## 모듈/패키지 import

In [1]:
import pandas as pd

## 데이터프레임 병합(merge)
* **2개**의 데이터프레임을 **지정한 기준**으로 병합
* `pd.merge(left, right)`
>* 주요 옵션
>   * `how` : 조인 방식 
>       * `'inner'` : 공통부분만 병합(default)
>       * `'outer'` : 완전 병합
>       * `'left'` : 왼쪽 기준 병합
>       * `'right'` : 오른쪽 기준 병합
>   * `on` : 공통컬럼명(양쪽에 같은 이름이 있을 때 사용)
>   * `left_on`, `right_on` : 병합 기준 컬럼명이 다를 때 사용
>   * `left_index`, `right_index` : 인덱스를 기준으로 병합

In [2]:
# 샘플데이터
df7 = pd.DataFrame({'이름':['Charles','Danial','Evan'],'영어':[80,100,100]})
df8 = pd.DataFrame({'이름':['Charles','Danial','Henry'],'수학':[75,100,60]})
df9 = pd.DataFrame({'이름':['Charles','Danial','Emma'],'영어':[90,80,90]})
df10 = pd.DataFrame({'성명':['Charles','Danial','Henry'],'수학':[75,100,60]})

In [3]:
display(df7)
display(df8)
display(df9)
display(df10)

        이름   영어
0  Charles   80
1   Danial  100
2     Evan  100

        이름   수학
0  Charles   75
1   Danial  100
2    Henry   60

        이름  영어
0  Charles  90
1   Danial  80
2     Emma  90

        성명   수학
0  Charles   75
1   Danial  100
2    Henry   60

#### 공통 컬럼명 기준으로 병합

In [ ]:
# -----------------
# df7,df8 병합
# -----------------

pd.merge(df7,df8)

        이름   영어   수학
0  Charles   80   75
1   Danial  100  100

In [ ]:
# -----------------
# df7,df8 병합
# outer join
# -----------------

pd.merge(df7,df8, how='outer')

        이름     영어     수학
0  Charles   80.0   75.0
1   Danial  100.0  100.0
2     Evan  100.0    NaN
3    Henry    NaN   60.0

In [ ]:
# -----------------
# df7,df8 병합
# left join
# -----------------

pd.merge(df7,df8, how='left')

        이름   영어     수학
0  Charles   80   75.0
1   Danial  100  100.0
2     Evan  100    NaN

In [ ]:
# -----------------
# df7,df8 병합
# right join
# -----------------
pd.merge(df7,df8, how='right')

        이름     영어   수학
0  Charles   80.0   75
1   Danial  100.0  100
2    Henry    NaN   60

#### 기준 컬럼명 지정하여 병합
* on='기준컬럼명'

In [8]:
display(df7)
display(df9)

        이름   영어
0  Charles   80
1   Danial  100
2     Evan  100

        이름  영어
0  Charles  90
1   Danial  80
2     Emma  90

In [ ]:
# -----------------
# df7,df9 병합
# -----------------
pd.merge(df7,df9, on='이름')

        이름  영어_x  영어_y
0  Charles    80    90
1   Danial   100    80

In [ ]:
# -----------------
# df7,df9 병합
# outer join
# -----------------

pd.merge(df7,df9, on='이름', how='outer')

        이름   영어_x  영어_y
0  Charles   80.0  90.0
1   Danial  100.0  80.0
2     Emma    NaN  90.0
3     Evan  100.0   NaN

In [ ]:
# -----------------
# df7,df9 병합
# left join
# -----------------
pd.merge(df7,df9, on='이름', how='left')

        이름  영어_x  영어_y
0  Charles    80  90.0
1   Danial   100  80.0
2     Evan   100   NaN

In [ ]:
# -----------------
# df7,df9 병합
# right join
# -----------------
pd.merge(df7,df9, on='이름', how='right')

        이름   영어_x  영어_y
0  Charles   80.0    90
1   Danial  100.0    80
2     Emma    NaN    90

#### 기준이 되는 컬럼명이 다른 경우

In [13]:
display(df7)
display(df10)

        이름   영어
0  Charles   80
1   Danial  100
2     Evan  100

        성명   수학
0  Charles   75
1   Danial  100
2    Henry   60

In [ ]:
# -----------------
# df7,df10 병합
# -----------------
pd.merge(df7,df10,left_on='이름',right_on='성명')

        이름   영어       성명   수학
0  Charles   80  Charles   75
1   Danial  100   Danial  100